mixin ShayariList {
  List shayaries = [
    {
      'title': 'Attitude 😎',
      'image': 'asset/attitude.png',
      'shayaries': <String>[
        'जिन्हे हम जहर लगते हैं \nवो कौनसा हमे शहद लगते हैं',
        'हम वहाँ खड़े होते हैं \n जहाँ पर मैटर बड़े होते है',
        'मेरे भाई शेर को जगाना \n और हमे सुलाना \n किसी के बस की बात नही है',
        'बादशाह हो या मालिक सलामी हम नही करते \n पैसे हो या कोई राजकुमारी गुलामी हम नही करते',
        'Attitude उतना ही दिखाओ \n जितना तुम्हारे सकल पे सूट करें',
        'मेरे पास जुनून है तभी तो \n तेरा गुरुर मेरे सामने चकनाचूर है',
        'खफा होने से पहले \n मेरी जिंदगी से दफा हो जाना',
        'रेस वो लोग लगाते है जिसे अपनी किस्मत आजमानी हो \n हम तो वो खिलाडी है जो अपनी किस्मत के साथ खेलते है',
        'मैंने कब कहा कीमत समझो तुम मेरी \n हमें बिकना ही होता तो यूँ तन्हा ना होतेा',
      ]
    },
    {
      'title': 'Alone 😔',
      'image': 'asset/alone.png',
      'shayaries': <String>[
        'चलते रहेंगे काफ़िले मेरे बैगर भी यहाँ \n एक सितारा टूट जाने से \n आसमान सूना नहीं होता',
        'अकेला हूँ पर मुस्कुराता बहुत हूँ, \n खुद का साथ, \n बड़ी शिद्दत से दे रहा हूँ …',
        'अपनो ने अकेला इतना कर दिया, \n कि अब अकेलापन ही अपना लगता है ।',
        'तन्हा रातें कुछ इस तरह से डराने लगी मुझे, \n मैं आज अपने पैरों की आहट से डर गया..!!',
        'चाहे जितना भी किसी को अपना बना लो, \n वो एक दिन आपको गैर महसूस करा ही देते हैं!',
        'इंसान सिर्फ एक कारण से अकेला पड़ जाता हैं, \n जब उसके अपने ही उसे गलत समझने लगते हैं..!!',
        'हजारों महफिलें हैं और लाखों मेले हैं, \n पर जहाँ तुम नहीं वहाँ हम अकेले हैं..!!',
        'अजब पहेलियाँ हैं हाथों की लकीरों में, \n सफ़र ही सफ़र लिखा हैं हमसफ़र कोई नहीं..!!',
        'दर्द जब हद से ज्यादा बढ़ जाए, \n तो वो ख़ामोशी का रूप ले लेता है।'
      ]
    },
    {
      'title': 'Bewafa 🎧',
      'image': 'asset/bewafa.png',
      'shayaries': <String>[
        'कुछ तो मजबूरियाँ रही होंगी \n यूँ कोई बेवफ़ा नहीं होता',
        'अकेला हूँ पर मुस्कुराता बहुत हूँ, \n खुद का साथ, \n बड़ी शिद्दत से दे रहा हूँ …!!',
        'कैसे गलत कह दूँ तेरी बेवफाई को, \n यही तो है जिसने मुझे मशहूर किया है !',
        'तुम्हारी तो फितरत थी सबसे मोहब्बत करने की, \n में बेवजह खुद को खुशनसीब समझने लगा !',
        'एक बेवफा को हमने दिल में जगह दी थी, \n ख़्वाबों की दुनिया अपनी उससे ही सजा दी थी।',
        'वो बेवफा है तो क्या हुआ उसे बेवफा ही रहने दो, \n हमने तो सच्ची मोहब्बत की थी हमे उनकी मोहब्बत का सताया ही रहने दो।',
        'मैं तेरे बाद कोई तेरे जैसा ढूँढता हूँ \n जो बेवफ़ाई करे और बेवफ़ा न लगे',
        'तेरी गली को छोड़ के पागल नहीं गया \n रस्सी तो जल गई है मगर बल नहीं गया',
        'एक अकेले की ख़ातिर जब दो कप कॉफी में \n चीनी आज मिलाते हैं तो रो देते हैं हम'
      ]
    },
    {
      'title': 'Breakup 💔',
      'image': 'asset/breakup.png',
      'shayaries': <String>[
        'जो पिंजरे काट कर उड़ना जानते है \n उन पंछियों को आज़ाद क्यों करे हम \n तुम्हे जाना था तुम चले गए \n अब तुम्हे रोज़ रोज़ याद क्यों करे हम',
        'तुम्हारी याद में जैसे हम रोते हैं, \n वैसे तो आजकल के लोग गहरी नींद में सोते हैं',
        'मैं ये जनता हूँ की आपको मुझसे नफरत नहीं है, \n लेकिन ये भी जनता हूँ की आपको मुझसे \n मोहब्बत भी नहीं है!!',
        'जिन्दगी की दौड़ में तजुर्बा कच्चा ही रह गया \n हम सीख न पाये ‘फरेब’ और दिल बच्चा ही रह गया',
        'दिल बहलाने वाले तो हज़ार मिल जयेंगे, \n मगर दिल लगाने वाले बहुत कम',
        'सोचा नहीं था जिंदगी में ऐसे भी फसाने होंगे, \n रोना भी जरूरी होगा और आंसू भी छिपाने होंगे।',
        'मनाया नहीं गया मुझसे इस बार, \n उसकी नाराज़गी में आबाद कोई और था.',
        'जो नजर से गुजर जाया करते हैं वो, \n सितारे अक्सर टूट जाया करते हैं !',
        'उसे सपने दिखाने की आदत थी और हम बुनते रहे, \n उसे झूठ बोलने की आदत थी और हम सुनते रहे',
      ]
    },
    {
      'title': 'Friendship 🫂',
      'image': 'asset/friendship.png',
      'shayaries': <String>[
        'तू मुझे भूल जाएगा तब भी मैं तुझे याद करूँगा \n दोस्त हु मैं तेरा खुद से पहले तेरे लिए दुआ करूँगा..!',
        'दोस्ती जब किसी से की जाए, \n दुश्मनों की भी राय ली जाए ',
        'हम को यारों ने याद भी न रखा, \n जौन यारों के यार थे हम तो',
        'दिल अभी पूरी तरह टूटा नहीं  \n दोस्तों की मेहरबानी चाहिए',
        'ये कहाँ की दोस्ती है कि बने हैं दोस्त नासेह  \n  कोई चारासाज़ होता कोई ग़म-गुसार होता',
        'दोस्ती आम है लेकिन ऐ दोस्त \n दोस्त मिलता है बड़ी मुश्किल से ',
        'दोस्तों को भी मिले दर्द की दौलत या रब  \n मेरा अपना ही भला हो मुझे मंज़ूर नहीं',
        'मिरा ज़मीर बहुत है मुझे सज़ा के लिए \n तू दोस्त है तो नसीहत न कर ख़ुदा के लिए',
        'आ कि तुझ बिन इस तरह ऐ दोस्त घबराता हूँ मैं  \n जैसे हर शय में किसी शय की कमी पाता हूँ मैं ',
      ]
    },
    {
      'title': 'Romantic 💘',
      'image': 'asset/romantic.png',
      'shayaries': <String>[
        'बदल जाओ वक्त के साथ \n या फिर वक्त बदलना सीखो \n मजबूरियों को मत कोसो \n हर हाल में चलना सीखो',
        'सुना है आज समंदर को बड़ा गुमान आया है, \n उधर ही ले चलो कश्ती जहां तूफान आया है।',
        'लिखना था कि \n खुश हैं तेरे बगैर भी यहां हम, \n  मगर कमबख्त... \n आंसू हैं कि कलम से \n पहले ही चल दिए।',
        'आहिस्ता चल ज़िन्दगी, \n अभी कई क़र्ज़ चुकाना बाकी है, \n कुछ दर्द मिटाना बाकी है, \n कुछ फ़र्ज़ निभाना बाकी है!!',
        'हम वो नहीं जो तुम्हे गम में छोड़ देंगे, \n हम वो नहीं जो तुजसे नाता तोड़ देंगे, \n हम वो है जो तुम्हारी साँसे रुके तो, \n अपनी साँसे छोड़ देंगे!!',
        'हमको ही क्यों देते हो \n प्यार का इल्जाम जरा खुद से \n भी पूछों इतने प्यारे क्यों हो..!',
        'कहने में तो मेरा दिल एक है लेकिन \n जिसको दिल दिया वो हजारी में एक है',
        'मोहब्बत में तेरी हम \n कुछ ऐसा कर जायेंगे, \n  संग तेरे हम जिए न जिए, \n बिन तेरे जरूर मर जायेंगे',
        'तेरा चेहरा कितना सुहाना लगता है \n तेरे आगे चाँद पुराना लगता है'
      ]
    },
    {
      'title': 'Love 🫶',
      'image': 'asset/love.png',
      'shayaries': <String>[
        'तू मिल गई है तो मुझपे नाराज है खुदा, \n कहता है की तू अब कुछ मांगता ही नही…!!!',
        'मैं वहां जाकर भी मांग लूं तुझे, \n कोई बता दे कुदरत के फैसले कहां होते है…!',
        'हिम्मत तो नही मुझमें की तुझे तेरे परिवार से छीन लू , \n  तुझे मेरे दिल से कोई निकाल दे इतना हक तो मैने खुद को भी नही दिया…!',
        'मैं नही चाहता वो मेरे बुलाने से आए, \n मैं चाहता हु वो रह ना पाए और बहाने से आए…!',
        'वादों की तरह इश्क भी आधा रहा, \n मुलाकाते आधी रही इंतजार ज्यादा रहा…!',
        'लोग मुझसे मेरी खुशी का राज पूछते है, \n कहो तो बता दू तुम्हारा नाम…!',
        'उम्र नही थी इश्क करने की, \n बस एक चेहरा देखा और गुनाह कर बैठे…!!!',
        'मोहतरमा आज हम फिर तुम्हारी यादों में बह गए, \n चाय पूरी पी ली मगर बिस्कुट रह गए…!!!',
        'तुम जिंदगी की वो कमी हो, \n जो शायद जिंदगी भर रहेगी…!!!',
      ]
    },
    {
      'title': 'Good Morning ☀',
      'image': 'asset/goodmorning.png',
      'shayaries': <String>[
        'मंजिल मिले न मिले ये तो मुक्कदर की बात है, \n हम कोशिश भी न करे ये तो गलत बात है! ',
        'जहां सूर्य की किरण हो वही प्रकाश होता है, \n और जहां प्रेम की भाषा हो वही परिवार होता है!',
        'बचा ले जो हर तुफान से उसे आस कहते है, \n बड़ा मजबूत है ये धागा जिसे विश्वाश कहते है!',
        'ऐ सूरज मेरे अपनों को पैगाम देना, खुशियों का दिन \n हंसी की शाम देना, जो भी पढ़े मेरे इस प्यारे से पैगाम को \n उसके चहरे पैर मीठी सी मुस्कान देना!',
        'कुछ रिश्ते ऊपर बनते है, कुछ रिश्ते लोग बनाते है, \n वो लोग बहुत खास होते है जो बिना रिश्ते के रिश्ता निभाते है!',
        'खुबसूरत होते है वो पल जब पलको में सपने होते है, \n चाहे जितने भी दूर रहे पर अपने तो अपने होते है!',
        'हँसना हँसाना ये कोशिश है मेरी, सबको खुश रखना चाहत है मेरी, \n कोई याद करे या ना करे हर किसी को याद करना आदत है मेरी!',
        'दुनिया का सबसे सुन्दर गिफ्ट किसी को दिल से \n याद करना और उसे एहसास दिलाना की आप हमारे लिए स्पेशल हो!',
        'कमी की कोई निश्चित परिभाषा नहीं होती है, \n अनुभव, रिश्ते, मान सन्मान और अच्छे मित्र \n सभी कमी का रूप होते है!',
      ]
    },
    {
      'title': 'Good Night 🌠',
      'image': 'asset/goodnight.png',
      'shayaries': <String>[
        'रात तो वक़्त की पाबंद है ढल जाएगी \n देखना ये है चरागों का सफर कितना है।',
        'अगर आप दुनिया से अपने लिए सर्वसिष्ठ पाना चाहते है, \n तो आपको दुनिया को अपना सर्वसेठ देना भी होगा।',
        'रात को जब चाँद सितारे चमकते हैं, \n हम हरदम आपकी याद में तड़पते हैं, \n आप तो चले जाते हो छोड़कर हमें, \n हम रात भर आपसे मिलने को तरसते हैं।',
        'रात को चुपके से आती है एक परी \n कुछ खुशियों के सपने लाती है एक परी \n कहती है सपनो के आगोश में खो जाओ \n भूल के सारे गम चुपके से सो जाओ।',
        'चांद के लिए सितारे अनेक है.. \n पर सितारों के लिए चांद एक है। \n आपके लिए तो हजारों होंगे परन्तु \n हमारे लिए तो आप हजारों में एक हैं।',
        'हर कोई सो जाता है कल के लिए, \n मगर ये नही सोचता की, \n आज जिसका दिल दुखाया है, \n वो सोया होगा या नही !',
        'भूल से कोई भूल हुई तो \n भूल समझ के भूल जाना \n पर भूलना सिर्फ भूल को \n भूल से भी हमे ना भुला जाना।',
        'ये रात की ख़ामोशी ये आलम ए तन्हाई \n फिर दर्द उठा दिल में फिर याद तेरी आयी',
        'इक रात है फैली हुई सदियों पर, \n हर लम्हा अंधेरों के असर में है !!',
      ]
    },
    {
      'title': 'Sad 🥺',
      'image': 'asset/sad.png',
      'shayaries': <String>[
        'वो पल कभी भूलाए नहीं जाते, \n जिसमे वक्त कम और लम्हे जयदा हो',
        'मोत का भी इलाज हो शायद, \n जिंदगी का इलाज नहीं',
        'सोचा ही नहीं की,  \n जिंदगी में कभी ऐसे भी फ़साने होंगे, \n  रोना भी जरुरी होगा, \n और आंसू भी छुपाने होंगे',
        'कभी मौका मिले तो, \n हम किस्मत से जरूर शिकायत करेंगे, \n क्यों छोड़ जाते है वो लोग, \n जिन्हे हम टूट कर चाहते है',
        'तुम से अच्छे तो मेरे दुश्मन है, \n जो बात बात पर कहते है तुम्हे छोड़ेंगे नहीं…!',
        'एक अजीब सी जंग है मुझमें, \n कोई मुझसे ही तंग है मुझमें…!',
        'तुमपर भी यकीन है, और मौत पर भी एतबार है, \n देखते है पहले कौन मिलता है, हमे दोनो का इंतजार है…!',
        'खाकर ठोकर ज़माने की, फिर लौट आए मैखाने में, \n मुझे देख कर मेरे गम बोले बड़ी देर लगा दी आने में…!',
        'चार दिन आंखो में नमी होगी, \n मैं मर भी जाऊं तो क्या कमी होगी…!',
      ]
    },
    {
      'title': 'Motivational 🏋️',
      'image': 'asset/img.png',
      'shayaries': <String>[
        'खुद से बन रहे हैं इसलिए समय लग रहा है \n हमें जिंदगी बनी बनाई नहीं मिली..!!!',
        'यही जुनून यही एक ख्वाब मेरा है, \n वहां चिराग जला दू जहां अंधेरा है..!!!',
        'पानी कितना भी गहरा हो तू दरिया पे नज़र रख, \n किनारा मिले ना मिले तहरने का हुनर रख..!!!',
        'मेरी महनत का पसीना है मेरे माथे पर, \n मुझसे ना कहना बाप की दी हुई दौलत उडाता है..!!!',
        'मुश्किलें और बढ़ा दीजिए मेरी, मैं आगे बढ़ता रहूंगा, \n मुझे हार की परवाह नहीं मैं तो जी जान से लड़ता रहूंगा..!!!',
        'नौकरी करना भी आसान नहीं है दोस्त, \n घर आने से ज्यादा, घर चलाना जरूरी हो जाता है..!!!',
        'कमियाबी सुबह के जैसी होती है, \n मांगने पर नही, जागने पर मिलती है..!!!',
        'हारता वो है जो शिकायत बार बार करता है, \n जीतता वो है जो कौसीस बार बार करता है..!!!',
        'शाखे रही तो फूल भी पत्ते भी आयेंगे, \n ये दिन अगर बुरे है तो अच्छे भी आयेंगे..!!!',
      ]
    },
  ];
}

//   List<String> item = [
//     '',
//     '',
//     '',
//     '',
//     '',
//     '',
//     '',
//     '',
//     '',
//     '',
//     'Motivational 🏋️',
//   ];
//
//   List<String> image = [
//     'asset/attitude.png',
//     'asset/alone.png',
//     'asset/bewafa.png',
//     'asset/breakup.png',
//     'asset/friendship.png',
//     'asset/romantic.png',
//     'asset/love.png',
//     'asset/goodmorning.png',
//     'asset/goodnight.png',
//     'asset/sad.png',
//     'asset/motivationl.png'
//   ];
//
//   // List<String> category1 = [
//   //   'जिन्हे हम जहर लगते हैं \nवो कौनसा हमे शहद लगते हैं',
//   //   'हम वहाँ खड़े होते हैं \n जहाँ पर मैटर बड़े होते है',
//   //   'मेरे भाई शेर को जगाना \n और हमे सुलाना \n किसी के बस की बात नही है',
//   //   'बादशाह हो या मालिक सलामी हम नही करते \n पैसे हो या कोई राजकुमारी गुलामी हम नही करते',
//   //   'Attitude उतना ही दिखाओ \n जितना तुम्हारे सकल पे सूट करें',
//   //   'मेरे पास जुनून है तभी तो \n तेरा गुरुर मेरे सामने चकनाचूर है',
//   //   'खफा होने से पहले \n मेरी जिंदगी से दफा हो जाना',
//   //   'रेस वो लोग लगाते है जिसे अपनी किस्मत आजमानी हो \n हम तो वो खिलाडी है जो अपनी किस्मत के साथ खेलते है',
//   //   'मैंने कब कहा कीमत समझो तुम मेरी \n हमें बिकना ही होता तो यूँ तन्हा ना होतेा',
//   // ];
//   //
//   // List<String> category2 = [
//   //   'चलते रहेंगे काफ़िले मेरे बैगर भी यहाँ \n एक सितारा टूट जाने से \n आसमान सूना नहीं होता',
//   //   'अकेला हूँ पर मुस्कुराता बहुत हूँ, \n खुद का साथ, \n बड़ी शिद्दत से दे रहा हूँ …',
//   //   'अपनो ने अकेला इतना कर दिया, \n कि अब अकेलापन ही अपना लगता है ।',
//   //   'तन्हा रातें कुछ इस तरह से डराने लगी मुझे, \n मैं आज अपने पैरों की आहट से डर गया..!!',
//   //   'चाहे जितना भी किसी को अपना बना लो, \n वो एक दिन आपको गैर महसूस करा ही देते हैं!',
//   //   'इंसान सिर्फ एक कारण से अकेला पड़ जाता हैं, \n जब उसके अपने ही उसे गलत समझने लगते हैं..!!',
//   //   'हजारों महफिलें हैं और लाखों मेले हैं, \n पर जहाँ तुम नहीं वहाँ हम अकेले हैं..!!',
//   //   'अजब पहेलियाँ हैं हाथों की लकीरों में, \n सफ़र ही सफ़र लिखा हैं हमसफ़र कोई नहीं..!!',
//   //   'दर्द जब हद से ज्यादा बढ़ जाए, \n तो वो ख़ामोशी का रूप ले लेता है।',
//   // ];
//
//   List<String> category3 = [
//
//   ];
//
//   List<String> category4 = [
//
//   ];
//
//   List<String> category5 = [
//
//   ];
//
//   List<String> category6 = [
//
//   ];
//
//   List<String> category7 = [
//
//   ];
//
//   List<String> category8 = [
//
//   ];
//
//   List<String> category9 = [
//
//   ];
//
//   List<String> category10 = [
//     'वो पल कभी भूलाए नहीं जाते, \n जिसमे वक्त कम और लम्हे जयदा हो',
//     'मोत का भी इलाज हो शायद, \n जिंदगी का इलाज नहीं',
//     'सोचा ही नहीं की,  \n जिंदगी में कभी ऐसे भी फ़साने होंगे, \n  रोना भी जरुरी होगा, \n और आंसू भी छुपाने होंगे',
//     'कभी मौका मिले तो, \n हम किस्मत से जरूर शिकायत करेंगे, \n क्यों छोड़ जाते है वो लोग, \n जिन्हे हम टूट कर चाहते है',
//     'तुम से अच्छे तो मेरे दुश्मन है, \n जो बात बात पर कहते है तुम्हे छोड़ेंगे नहीं…!',
//     'एक अजीब सी जंग है मुझमें, \n कोई मुझसे ही तंग है मुझमें…!',
//     'तुमपर भी यकीन है, और मौत पर भी एतबार है, \n देखते है पहले कौन मिलता है, हमे दोनो का इंतजार है…!',
//     'खाकर ठोकर ज़माने की, फिर लौट आए मैखाने में, \n मुझे देख कर मेरे गम बोले बड़ी देर लगा दी आने में…!',
//     'चार दिन आंखो में नमी होगी, \n मैं मर भी जाऊं तो क्या कमी होगी…!',
//   ];
//
//   List<String> category11 = [
//
//   ];
// }
